## Import Pandas Module

In [1]:
import pandas as pd

## Series is one dimension vector

In [2]:
l = [10,20,30,40]
a = pd.Series(l)
a

0    10
1    20
2    30
3    40
dtype: int64

## Dicionary to Dataframe (Combination of Rows and Columns)

In [12]:
b = { 'Name':['M','B','C','D','F'],
    'Age':[10,20,30,40,50],
    'City':['A','B','C','D','E']}
c = pd.DataFrame(b)
#c[['Name','Age','']]
#c.iloc[1:5,0]
c
#x = c['Age']

  Name  Age City
0    M   10    A
1    B   20    B
2    C   30    C
3    D   40    D
4    F   50    E

In [ ]:
c.set_index('City',inplace= True)

In [23]:
c.iloc[1:3,1]

City
B    20
C    30
Name: Age, dtype: int64

In [24]:
c

     Name  Age
City
A       M   10
B       B   20
C       C   30
D       D   40
E       F   50

In [25]:
c.loc['A':'C']

     Name  Age
City
A       M   10
B       B   20
C       C   30

In [10]:
c.tail()

  Name  Age
0    M   10
1    B   20
2    C   30
3    D   40
4    F   50

In [6]:
c.iloc[1:4,0:2]

  Name  Age
1    B   20
2    C   30
3    D   40

In [13]:
c[1:2]

  Name  Age
2    B   20

### Simple

In [7]:
# THis is slicing
c.iloc[1:2,1]

2    20
Name: Age, dtype: int64

In [8]:
c[['Name','Age']]

  Name  Age
0    M   10
1    B   20
2    C   30
3    D   40
4    F   50

In [ ]:
print(c[['Name','Age']])

## Read CSV from Local machine

In [27]:
df = pd.read_csv('Mall_Customers.csv')
df.head()

   CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40

In [10]:
df.columns

Index(['CustomerID', 'Genre', 'Age', 'Annual Income (k$)',
       'Spending Score (1-100)'],
      dtype='object')

In [12]:
df.head(10)

   CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40

In [32]:
df.tail()

     CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
195         196  Female   35                 120                      79
196         197  Female   45                 126                      28
197         198    Male   32                 126                      74
198         199    Male   32                 137                      18
199         200    Male   30                 137                      83

In [15]:
#df.describe()
df[['Age', 'Annual Income (k$)',
       'Spending Score (1-100)']].describe()

              Age  Annual Income (k$)  Spending Score (1-100)
count  200.000000          200.000000              200.000000
mean    38.850000           60.560000               50.200000
std     13.969007           26.264721               25.823522
min     18.000000           15.000000                1.000000
25%     28.750000           41.500000               34.750000
50%     36.000000           61.500000               50.000000
75%     49.000000           78.000000               73.000000
max     70.000000          137.000000               99.000000

In [18]:
#df.set_index('CustomerID', inplace= True)
df.head()

             Genre  Age  Annual Income (k$)  Spending Score (1-100)
CustomerID
1             Male   19                  15                      39
2             Male   21                  15                      81
3           Female   20                  16                       6
4           Female   23                  16                      77
5           Female   31                  17                      40

In [21]:
df.set_index('Genre', inplace= True)
df.head()

        Age  Annual Income (k$)  Spending Score (1-100)
Genre
Male     19                  15                      39
Male     21                  15                      81
Female   20                  16                       6
Female   23                  16                      77
Female   31                  17                      40

In [ ]:
df.loc[['Female'],['Age', 'Annual Income (k$)',
       'Spending Score (1-100)']]

### See the Top five rows of dataset

In [10]:
banks.head(10)

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb",26-May-17,01-Jun-17
1,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,05-May-17,01-Jun-17
2,First NBC Bank,New Orleans,LA,58302,Whitney Bank,28-Apr-17,23-May-17
3,Proficio Bank,Cottonwood Heights,UT,35495,Cache Valley Bank,03-Mar-17,18-May-17
4,Seaway Bank and Trust Company,Chicago,IL,19328,State Bank of Texas,27-Jan-17,18-May-17
5,Harvest Community Bank,Pennsville,NJ,34951,First-Citizens Bank & Trust Company,13-Jan-17,18-May-17
6,Allied Bank,Mulberry,AR,91,Today's Bank,23-Sep-16,17-Nov-16
7,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,19-Aug-16,01-Jun-17
8,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,06-May-16,06-Sep-16
9,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,29-Apr-16,06-Sep-16

### See last five rows of dataset

In [12]:
banks.tail(10)

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
541,Net 1st National Bank,Boca Raton,FL,26652,Bank Leumi USA,01-Mar-02,09-Apr-08
542,"NextBank, NA",Phoenix,AZ,22314,No Acquirer,07-Feb-02,05-Feb-15
543,Oakwood Deposit Bank Co.,Oakwood,OH,8966,The State Bank & Trust Company,01-Feb-02,25-Oct-12
544,Bank of Sierra Blanca,Sierra Blanca,TX,22002,The Security State Bank of Pecos,18-Jan-02,06-Nov-03
545,"Hamilton Bank, NA",Miami,FL,24382,Israel Discount Bank of New York,11-Jan-02,21-Sep-15
546,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB",27-Jul-01,19-Aug-14
547,Malta National Bank,Malta,OH,6629,North Valley Bank,03-May-01,18-Nov-02
548,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,02-Feb-01,18-Feb-03
549,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,14-Dec-00,17-Mar-05
550,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,13-Oct-00,17-Mar-05

## To get Columns name of Dataframe

In [13]:
banks.columns

Index(['Bank Name', 'City', 'ST', 'CERT', 'Acquiring Institution',
       'Closing Date', 'Updated Date'],
      dtype='object')

## To get Dataframe information like number of Rows and comluns as well as datatypes

In [14]:
banks.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 551 entries, 0 to 550
Data columns (total 7 columns):
Bank Name                551 non-null object
City                     551 non-null object
ST                       551 non-null object
CERT                     551 non-null int64
Acquiring Institution    551 non-null object
Closing Date             551 non-null object
Updated Date             551 non-null object
dtypes: int64(1), object(6)
memory usage: 30.2+ KB

## To get numerical inforamtion about integer columns

In [35]:
banks.apply(lambda b : [b['Bank Name'], b['ST'],b['CERT']] ,axis = 1)

0                        [Fayette County Bank, IL, 1802]
1      [Guaranty Bank, (d/b/a BestBank in Georgia & M...
2                            [First NBC Bank, LA, 58302]
3                             [Proficio Bank, UT, 35495]
4             [Seaway Bank and Trust Company, IL, 19328]
5                    [Harvest Community Bank, NJ, 34951]
6                                  [Allied Bank, AR, 91]
7              [The Woodbury Banking Company, GA, 11297]
8                    [First CornerStone Bank, PA, 35312]
9                         [Trust Company Bank, TN, 9956]
10               [North Milwaukee State Bank, WI, 20364]
11                   [Hometown National Bank, WA, 35156]
12                      [The Bank of Georgia, GA, 35259]
13                             [Premier Bank, CO, 34112]
14                           [Edgebrook Bank, IL, 57772]
15                               [Doral Bank, PR, 32102]
16        [Capitol City Bank & Trust Company, GA, 33938]
17                  [Highland Community Bank, IL, 20290]
18        [First National Bank of Crestview , FL, 17557]
19                       [Northern Star Bank, MN, 34983]
20     [Frontier Bank, FSB D/B/A El Paseo Bank, CA, 3...
21      [The National Republic Bank of Chicago, IL, 916]
22                            [NBRS Financial, MD, 4862]
23                    [GreenChoice Bank, fsb, IL, 28462]
24                 [Eastside Commercial Bank, GA, 58125]
25                  [The Freedom State Bank , OK, 12483]
26                              [Valley Bank, FL, 21793]
27                              [Valley Bank, IL, 10450]
28              [Slavie Federal Savings Bank, MD, 32368]
29                    [Columbia Savings Bank, OH, 32284]
                             ...
521                            [IndyMac Bank, CA, 29730]
522                [First Integrity Bank, NA, MN, 12736]
523                       [ANB Financial, NA, AR, 33901]
524                                [Hume Bank, MO, 1971]
525                  [Douglass National Bank, MO, 24660]
526                       [Miami Valley Bank, OH, 16848]
527                                 [NetBank, GA, 32575]
528               [Metropolitan Savings Bank, PA, 35353]
529                          [Bank of Ephraim, UT, 1249]
530                           [Reliance Bank, NY, 26778]
531    [Guaranty National Bank of Tallahassee, FL, 26...
532                     [Dollar Savings Bank, NJ, 31330]
533                    [Pulaski Savings Bank, PA, 27203]
534    [First National Bank of Blanchardville, WI, 11...
535                   [Southern Pacific Bank, CA, 27094]
536             [Farmers Bank of Cheneyville, LA, 16445]
537                            [Bank of Alamo, TN, 9961]
538              [AmTrade International Bank, GA, 33784]
539            [Connecticut Bank of Commerce, CT, 19183]
540                        [New Century Bank, MI, 34979]
541                   [Net 1st National Bank, FL, 26652]
542                            [NextBank, NA, AZ, 22314]
543                 [Oakwood Deposit Bank Co., OH, 8966]
544                   [Bank of Sierra Blanca, TX, 22002]
545                       [Hamilton Bank, NA, FL, 24382]
546                      [Superior Bank, FSB, IL, 32646]
547                      [Malta National Bank, OH, 6629]
548         [First Alliance Bank & Trust Co., NH, 34264]
549        [National State Bank of Metropolis, IL, 3815]
550                        [Bank of Honolulu, HI, 21029]
Length: 551, dtype: object

In [15]:
banks.describe()

               CERT
count    551.000000
mean   31729.392015
std    16449.761311
min       91.000000
25%    20315.000000
50%    32218.000000
75%    35375.500000
max    58701.000000

##  To verify dataframe has null value or not, if it is then drop or fill by particuler values

In [ ]:
banks.isnull()
banks.dropna()
banks.fillna()

## To iterate throw loop to get individual index

In [ ]:
for i,j in c.iterrows():
    print(j[['Name']])

In [ ]:
#for i,j in enumerate(c):
#    print(i,j)
for i,j in c.items():
    print(j)

In [ ]:
c

## Join and Merging two dataframe

In [ ]:
df1 = {'Day':[1,2,3,4,5],"Vistiers":[1000,200,300,500,750],'Bounce_Rate':[20,30,10,50,60]}
df1

In [23]:
dict1 = {"HPI":[80,70,50],"Int_Rate":[2,1,2],"GDP":[50,54,60],"Temp":[50,50,60]}
dict2 = {"HPI":[80,70,50],"Int_Ratee":[2,1,2],"GD":[50,50,60],"GDW":[50,50,10]}

In [24]:
df1 = pd.DataFrame(dict1)
df1
df2 = pd.DataFrame(dict2)
df2

merged = pd.merge(df1,df2)
merged

   HPI  Int_Rate  GDP  Temp  Int_Ratee  GD  GDW
0   80         2   50    50          2  50   50
1   70         1   54    50          1  50   50
2   50         2   60    60          2  60   10

In [30]:
df1 = pd.DataFrame({"Int_Rate":[2,1,2,3], "IND_GDP":[50,45,45,67]}, index=[2001, 2002,2003,2004])
 
df2 = pd.DataFrame({"Low_Tier_HPI":[50,45,67,34],"Unemployment":[1,3,5,6]}, index=[2001, 2003,2004,2004])
 
joined= df1.join(df2)
print(joined)

      Int_Rate  IND_GDP  Low_Tier_HPI  Unemployment
2001         2       50          50.0           1.0
2002         1       45           NaN           NaN
2003         2       45          45.0           3.0
2004         3       67          67.0           5.0
2004         3       67          34.0           6.0

In [32]:
df2.drop(columns=())


joined.isnull()

joined.fillna(48)

.#joined.isnull()

      Int_Rate  IND_GDP  Low_Tier_HPI  Unemployment
2001         2       50          50.0           1.0
2002         1       45          48.0          48.0
2003         2       45          45.0           3.0
2004         3       67          67.0           5.0
2004         3       67          34.0           6.0

In [35]:
country = pd.read_csv("E:\DOWNLOAD\TEMP.CSV",index_col = 0)

In [36]:
country.head()

             Country Code      2010     2011     2012   2013      2014
Country name
Afganistan            AFG  20.10000  20.9000  19.7000  21.10  20.80000
Angola                AGO  10.80000  10.7000  10.7000  10.50  10.60000
Albania               ALB  25.79990  27.0000  28.3000  29.20  28.70000
Arab world            ARB  25.00221  28.1175  29.1131  29.53  29.70457
UAE                   ARE   9.80002   9.8000   9.8000   9.90  10.00000

In [35]:
country.loc[['Afganistan'],['2010','2011','2012']]

              2010  2011  2012
Country name
Afganistan    20.1  20.9  19.7

In [33]:
country.loc['Afganistan']

Country Code     AFG
2010            20.1
2011            20.9
2012            19.7
2013            21.1
2014            20.8
Name: Afganistan, dtype: object

In [36]:
df= pd.DataFrame({"Day":[1,2,3,4], "Visitors":[200, 100,230,300], "Bounce_Rate":[20,45,60,10]}) 
 
df

   Day  Visitors  Bounce_Rate
0    1       200           20
1    2       100           45
2    3       230           60
3    4       300           10

In [37]:
df.set_index("Day", inplace= True)
 
print(df)

     Visitors  Bounce_Rate
Day
1         200           20
2         100           45
3         230           60
4         300           10

In [38]:
df = pd.DataFrame({"Day":[1,2,3,4], "Visitors":[200, 100,230,300], "Bounce_Rate":[20,45,60,10]})
 
df = df.rename(columns={"Visitors":"Users"})
 
print(df)

   Day  Users  Bounce_Rate
0    1    200           20
1    2    100           45
2    3    230           60
3    4    300           10

In [40]:
df1 = pd.read_csv('YesBank.csv',index_col = 0)
y = df1.head()

In [44]:
df2 = pd.read_csv('Page_Indu.csv',index_col = 0)
p = df2.head()

In [53]:
y,p

(        Open    High     Low   Close
 Date
 1     174.00  194.30  160.20  181.75
 2     192.00  231.40  147.00  169.65
 3     180.00  268.45  168.60  188.05
 4     347.20  350.00  166.15  183.45
 5     369.95  404.00  338.00  343.40,
           Open      High       Low     Close
 Date
 1     20620.00  20996.15  17622.00  18175.45
 2     19829.65  21126.00  19638.00  20588.85
 3     22900.00  23649.95  19011.00  19687.60
 4     25088.00  25818.00  22597.90  22947.75
 5     22500.00  25462.85  22129.65  24897.35)

In [55]:
pd.merge(y,p,'right',suffixes=('_x', '_y'))

       Open      High       Low     Close
0  20620.00  20996.15  17622.00  18175.45
1  19829.65  21126.00  19638.00  20588.85
2  22900.00  23649.95  19011.00  19687.60
3  25088.00  25818.00  22597.90  22947.75
4  22500.00  25462.85  22129.65  24897.35